{
  "user_device_rel": "1 person to n devices; n people to m devices",
  "target_users": "Individual; Group work",
  "pid": "Ballagas2004",
  "focus": "Software",
  "device_mount": "Handheld",
  "pid_done": "2",
  "scale": "Room; Buildings",
  "input_modalities": "Touch; 3D gestures",
  "devices_included": "Phone; Public display",
  "use_cases_desc": "\"games, interactive art, digital bulletin boards and advertising. [...] mobile phone's unique ID can enable a subscription-based gaming model [...] phone can store game state in the event that gameplay is interrupted\"\r\n\r\n\"interactive art installations that often enrich our daily routines and encour age interaction with our familiar strangers or public digital bulletin boards like those envisioned in the Plasma Poster Network [13] which provide an outlet for communities to share and disseminate news, announcements and ideas\"\r\n\r\n\"While the most widely used application of large public displays to date is to display static information and advertisements, we typically have no method for automatically storing information from these displays. Instead we are forced to write the information down, or more commonly, just simply remember it. We can use mobile phones as a portable storage device to pull interesting information from the display and take it with us.\"",
  "evaluation": "None",
  "contentlength": "6",
  "contribution_desc": "A summary of the different types of user interactions and thinking-points for deployments of large publich displays (serdendipiti, portability, sanitation, dexterity, multi-user, physical security, information security and privacy. scial acceptability, interruptability, intentional vs. unintentional interaction, and maintenance). \r\nA usage paradigm for interaction with larg plublic displays, through their own mobile phones. The connection between the display and the phone is established by scanning a Visual Code (similar to QR codes) with the phones camera. The connection is established via Bluetooth and then phone's camera is to detect a phones relavtive movements. The phone then acts as a 3 DOF input device for the public display. ",
  "pid_access": 1534756815,
  "papertype": "Workshop",
  "tracking_characteristic": "Inside-out tracking; Orientation; Tracking devices only",
  "use_cases": "Entertainment",
  "output_modalities": "Screen output",
  "deployment": "None",
  "interaction_techniques": "Remote control; Data transfer/sharing",
  "connection_classification": "P2P",
  "device_models": "SMART Board; Nokia 6600",
  "tracking_tech": "Camera-based tracking; Fiducials",
  "network_infrastructure": "Bluetooth",
  "contribution": "Interaction techniques"
}