{
  "target_users": "Expert users; developers",
  "pid": "Barsotti2017",
  "focus": "Software",
  "device_mount": "Handheld; Mounted to wall",
  "pid_done": "2",
  "scale": "Room",
  "input_modalities": "3D gestures; Touch",
  "devices_included": "Public display; Smart watch; Phone",
  "use_cases_desc": "- \"Tour\" showcases interesting places to visit through an image gallery displayed in the public display, e.g. in a tourism office. \r\n- \"Dress Shop\" is for \"a clothing store equipped with a public display, in which the products for sale in that shop are shown\"\r\n- \"Car configurator [...] allows users to personalize a car model by selecting specific accessories, and receive associated price quotes\"",
  "evaluation": "User study (qualitative); Deployment with developers",
  "contentlength": "9",
  "contribution_desc": "The contribution are the design and implementation of a web framework that allows developers to implement cross-device gestures across multiple devices (i.e. a personal device and a public display). Mid-air gesture are supported via a Kinect v2 and touch gesture recognotion on devices are done via HammerJS. The communication between devices is done via WebSockets, a nodejs server manages the communication. \r\n\r\nThree example applications have been developed and a qualitative user-study with developers (students, researcher, etc) has been conducted to evaluated usefuleness and applicability of the toolkit. ",
  "pid_access": 1536779230,
  "papertype": "Full paper",
  "tracking_characteristic": "Tracking users only; Outside-in tracking",
  "use_cases": "Tourism; Commercial (shopping); Car configuration (personalisation and shopping)",
  "output_modalities": "Screen output",
  "deployment": "Lab study",
  "interaction_techniques": "Data transfer/sharing; UI distribution; Cross-device task chaining; Remote control",
  "connection_classification": "Via remote server",
  "toolkits": "NodeJS; HammerJS; jQuery",
  "device_models": "Samsung Galaxy S5; iPhone 5S",
  "tracking_tech": "Kinect",
  "network_infrastructure": "WiFi",
  "contribution": "Toolkit, middleware; cross-device gestures",
  "crossdevice_def": "\"devices can cooperate and coordinate with each other to encourage interaction with the information presented in public displays.\"\r\n\r\n\"cross-device gestures refers to gestures that are performed in multiple devices within some temporal constraint in order to obtain a combined gesture\"\r\n\r\n\"Cross-device input and output [...] refer[s] to gestures that are performed on one device but their\r\neffects change the user interface of another device as well\""
}