{
  "user_device_rel": "n people to m devices",
  "target_users": "Group work; Expert users",
  "pid": "BeaudouinLafon2012",
  "focus": "Hardware; Software",
  "device_mount": "Mounted to wall; Handheld",
  "pid_done": "2",
  "scale": "Room",
  "input_modalities": "Keyboard; Mouse; 3D gestures",
  "tracking_range": "Whole room",
  "devices_included": "Whiteboard, large vertical display; Tabletop, large horizontal display; Laptop; Phone",
  "use_cases_desc": "Scientific work e.g. visualisations of neuroimagery or astronomical images.",
  "contentlength": "12",
  "contribution_desc": "Gives an overview of a number of projects surrounding the multi-surface environment \"The WILD Room\" that consists of a large display wall, interactive tables and a VICON tracking system.",
  "tracking_accuracy": "<1mm",
  "pid_access": 1536781516,
  "papertype": "Journal Article",
  "use_cases": "Knowledge workers",
  "output_modalities": "Screen output",
  "deployment": "None",
  "interaction_techniques": "Visualisation; UI distribution",
  "connection_classification": "Via remote server",
  "toolkits": "TUIO: OSC; OpenGL; Python; Java",
  "tracking_characteristic": "Tracking users and devices; Location 3D; Outside-in tracking",
  "tracking_tech": "Vicon",
  "network_infrastructure": "Internet",
  "contribution": "System; Use-case, application; Interaction techniques; Study, deployment; Study (human factors)",
  "crossdevice_def": "\"Our concept of ubiquitous instrumental interaction separates interaction from the rest of the application [3]. An interaction instrument mediates interaction between a user and the objects of interest. For example, users can designate objects with a pointing instrument, move them with a drag-and-drop instrument, and change their color with a color selection instrument. Instruments are independent of the objects they operate on: they need only know that the object implements a given protocol, such as selecting, changing position, or setting a color. Multiple instruments can be used in parallel. Instruments can also be embodied in portable devices---for example, a smartphone used as a laser pointer. In this case, the instrument runs on the device and interacts with objects located on other surfaces\""
}