{
  "user_device_rel": "n people to m devices",
  "unsolved": "Not an actual framework or toolkit. Only theoretical description. ",
  "target_users": "Expert users",
  "pid": "Chmielewski2014",
  "focus": "Software",
  "pid_done": "2",
  "input_modalities": "Touch; Keyboard; Mouse; 3D gestures; Speech",
  "devices_included": "Phone; Tablet; Smart watch; Public display; TV; Laptop; Other devices; Desktop computer; Tangibles",
  "use_cases_desc": "\"a game where a player gains credibility points by performing quests. The quests are designed to gather real-life data at specific locations. Therefore, a player has to travel to a specific location and provide requested information (a photo or a sound recording).\"",
  "evaluation": "Technical evaluation (e.g., runtime, roundtrip)",
  "contentlength": "6.5",
  "contribution_desc": "Paper proposes Device Independent Architecture (DIA), a concept which provides separation of applications from devices and facilitates development of device-independent applications.\r\n\"The main idea behind the DIA is to move the processing out of end-devices to a cloud-based infrastructure and to introduce a set of protocols and services that separate applications from end-devices and provide support for development of multi-device applications.\"\r\nIt \"originates from Service-Oriented Architecture, where software systems are decomposed into atomic services, while processes use necessary services without knowing implementation details of systems that provide these services.\"\r\n",
  "pid_access": 1537281572,
  "device_models": "Windows phone",
  "output_modalities": "Screen output; Audible/speech",
  "deployment": "None",
  "interaction_techniques": "UI distribution",
  "connection_classification": "Via remote server",
  "use_cases": "Game; Entertainment",
  "network_infrastructure": "Internet",
  "contribution": "Theory; Toolkit, middleware",
  "crossdevice_def": "\"devices should operate in the invisible (calm) way influencing the real world, but not interacting directly with people. People only notice the results of device activities rather than the devices themselves.\""
}