{
  "user_device_rel": "n people to m devices",
  "target_users": "Individual; Group work",
  "pid": "Dang2014",
  "focus": "Software",
  "device_mount": "Handheld; Placed loosely around user (e.g., table)",
  "pid_done": "2",
  "scale": "Near, personal space",
  "input_modalities": "Touch",
  "devices_included": "Tablet; Public display; Tabletop, large horizontal display",
  "use_cases_desc": "- MediaBrowser for collaborative reviewing of media data on a large tabletop display. \r\n\r\n- Public Display Toucher for interaction with a public display via a mobile, handheld device. ",
  "evaluation": "Technical evaluation (e.g., runtime, roundtrip)",
  "contentlength": "8.5",
  "contribution_desc": "The paper's contribution is Environs, a \"software architecture and implementation details of our approach to enable interactive applications for MDEs [Multi Display Environments]\". The authors \"address questions regarding design, architecture, and implementation, that arise when engineering frameworks for MDEs supporting high resolution and low latency video portals\".\r\nThis middleware focusses on enabling \"portals\" that \"replicate part of a large workspace to the smaller workspace on a mobile device at hand\", forwarding touch input, IMU, gestures, and video output. ",
  "pid_access": 1536779784,
  "papertype": "Full paper",
  "tracking_characteristic": "Tracking devices only; Outside-in tracking",
  "use_cases": "Education; Knowledge workers; Entertainment",
  "output_modalities": "Screen output",
  "deployment": "None",
  "interaction_techniques": "Data transfer/sharing; UI distribution; Remote control",
  "connection_classification": "Via remote server; P2P",
  "device_models": "Microsoft Perceptive Pixel; Android tablets; iPad",
  "tracking_tech": "Fiducials",
  "network_infrastructure": "WiFi; Internet",
  "contribution": "Toolkit, middleware",
  "crossdevice_def": "\"Such environments, called MDEs (Multi-Display Environments), promise for novel applications, usage scenarios and interaction techniques spanned across multiple displays\".\r\n\r\nPremise: Tabletop and wall displays exists and more small multi-touch devices become prevalent. \"When considering both trends, occasions and scenarios where tabletop systems and mobile devices form a coupled interaction space are expected to become increasingly widespread\"."
}