{
  "user_device_rel": "1 person to n devices; n people to m devices",
  "target_users": "Individual; Group work",
  "pid": "GarciaSanjuan2016a",
  "focus": "Software",
  "cost": "very low",
  "device_mount": "Placed loosely around user (e.g., table); Handheld",
  "pid_done": "2",
  "scale": "Near, personal space; Social space",
  "input_modalities": "3D gestures",
  "tracking_range": "field of view of a tablet's camera",
  "devices_included": "Phone; Tablet; Tangibles",
  "use_cases_desc": "- Transferring of virtual elements between tablets to sort objects\r\n- Collaborative jigsaw puzzle. Tablets are arrange side by side and puzzle pieces can be transferred across the \"canvas\" made out of multiple tablets. ",
  "evaluation": "Quality measurements (e.g., accuracy of tracking); User study (quantitative, controlled lab experiment)",
  "contentlength": "6.5",
  "contribution_desc": "The paper explores the suitability of mid-air gestures for educational games with children, using the previous work of MarkAirs. The authors describe two use-case games that can be used with school children to for exploring and learning, using multiple devices as controlers and displays in AR.  \r\nThey then report on a quantitatve study with school children, evaluating the accuracy of mid-air AR interaction for school children. ",
  "tracking_accuracy": "error rates: 27px for translation; 8.41 degrees for rotation; 4.97% error rate for scaling",
  "pid_access": 1532446214,
  "papertype": "Full paper",
  "tracking_characteristic": "Outside-in tracking; Location 3D; Tracking devices only",
  "use_cases": "Education; games",
  "additional_hardware": "AR markers",
  "output_modalities": "Screen output",
  "deployment": "Lab study",
  "interaction_techniques": "Manipulation of content on tablets; control of content; AR manipulation",
  "tracking_reliability": "No handling of occlusion",
  "toolkits": "academic toolkits",
  "device_models": "10.1\" Android tablet",
  "tracking_tech": "Camera-based tracking; Fiducials; MarkAir",
  "contribution": "Use-case, application; Interaction techniques; Study (human factors)",
  "crossdevice_def": "\"[...] several recent works (e.g., [4,19]) have attempted to build Multi-Display Environments (MDEs) in a way that several devices are placed near one another on a flat surface (e.g., a table) and belong to the same logical workplace.\"\r\n\r\n\"[...] table-like shape provides in-creased awareness [...] parallel interaction, and, therefore, support for social and collaborative activities [16], whose benefits in learning have been widely reported in the literature\""
}