{
  "user_device_rel": "n people to m devices",
  "target_users": "Group work",
  "pid": "GonzaloRamos2009",
  "focus": "Software",
  "device_mount": "Placed loosely around user (e.g., table)",
  "pid_done": "2",
  "scale": "Social space",
  "input_modalities": "Touch; Keyboard",
  "devices_included": "Toshiba Portege 3500 Tablet PC; Microsoft Surface Table",
  "use_cases_desc": "Photo-sharing between devices and on a tabletop",
  "evaluation": "User study (quantitative, controlled lab experiment)",
  "contentlength": "47",
  "contribution_desc": "The paper introduces the problem of synchronous gestures in multi-display environments and explores a number of interaction techniques for pairing devices by: bumping, gestures across multiple displays (stitching), cooperative stitching, simultaneous button presses on devices (BlueRendezvous). For each of the techniques the rationale, design, implementation is discussed and a usability study is presented. Finally the BlueTable system is presented that demonstrates how an interactive table can be used ad-hoc together with mobile devices.",
  "pid_access": 1536758278,
  "papertype": "Journal Article",
  "tracking_characteristic": "Tracking devices only; Inside-out tracking",
  "output_modalities": "Screen output",
  "deployment": "Lab study",
  "interaction_techniques": "Data transfer/sharing",
  "tracking_tech": "Accelerometer; Bluetooth",
  "contribution": "Interaction techniques; System; Study (human factors)",
  "crossdevice_def": "\"Synchronous gestures enable colocated users to combine multiple devices into a heterogeneous display environment, where the users may establish a transient network connection with other select colocated users to facilitate the pooling of input capabilities, display resources, and the digital contents of each device.\"\r\n\r\n\"For example, people at a meeting could connect their mobile devices to one another or to existing infrastructure, such as an interactive tabletop computer, to form an ad hoc heterogeneous multi-display environment. Such an environment facilitates collaborative sharing of files and resources with other devices of the user's choosing and enables new functionality emerging from the combined capabilities of multiple devices.\"\r\n\r\n\"A dynamic multidevice environment must respect the underlying social fabric of collaborative interaction by providing flexible means for colocated users to work together across a range of physical proximity and relative body orientation. For example, users may wish to (a) view content side-by-side with a coworker on a shared display, (b) negotiate terms in a face-to-face meeting with a rival seated at the opposite side of a table, or (c) share information with some colleagues on the other side of a crowded meeting room-but not with rivals at the meeting.\""
}