{
  "user_device_rel": "n people to m devices",
  "target_users": "Group work",
  "pid": "Homaeian2018",
  "focus": "Software",
  "device_models": "Microsoft Surface Pro3",
  "device_mount": "Handheld, Placed on floor",
  "pid_done": "2",
  "scale": "Social space",
  "input_modalities": "Touch",
  "devices_included": "Tabletop, large horizontal display; Tablet",
  "use_cases_desc": "Sense making around a geospatial dataset focused on the Canadian Arctic region.",
  "evaluation": "User study (quantitative, controlled lab experiment); User study (qualitative)",
  "contentlength": "10",
  "contribution_desc": "Study of cross-device interaction techniques in mixed-focus collaboration. Compares two techniques TILT and TOUCH.\r\nTOUCH uses direct touch on shared surface to update ROI on tablet. With TILT the ROI was handled through remote control by tilting the tablet. Results show that most prefer TOUCH which supports tightly synchronised discussions of data, while TILT facilitated easy access to out-of-reach data, particularly during independent data browsing.",
  "pid_access": 1535621742,
  "papertype": "Full paper",
  "use_cases": "Knowledge workers; Sense-making; Mixed-focus collaboration",
  "output_modalities": "Screen output",
  "deployment": "Lab study",
  "interaction_techniques": "Data exploration; Remote control; Cross-device task chaining; Visualisation; Conduit gestures",
  "tracking_characteristic": "Tracking devices only",
  "tracking_tech": "Tilt, touch",
  "contribution": "Study, deployment; Interaction techniques",
  "crossdevice_def": "\"Our XDE modeled an Overview+Detail (O+D) [10] display environment, in which the tabletop (the \"Overview\" view; (Figure 1a) showed a geographic map with icons depicting locations that had associated geotagged data that could be viewed on a personal tablet (the \"Detail\" view; (Figure 1b). Consistent with other O+D displays, a \"Region of Interest\" (ROI) selection box was provided in the overview display (on the tabletop) to control which data were displayed in the detail view (on the tablet).\""
}