{
  "user_device_rel": "1 person to n devices",
  "unsolved": "technical infrastructure (ActivitySpace)",
  "target_users": "Individual",
  "pid": "Houben2013",
  "focus": "both",
  "device_mount": "Placed loosely around user (e.g., table)",
  "pid_done": "2",
  "scale": "Near, personal space",
  "input_modalities": "Touch",
  "devices_included": "Tablet; Desktop computer; Laptop; Phone",
  "use_cases_desc": "transitions between nomadic and stationary work contexts; activity-aware devices; activity-based computing",
  "evaluation": "None",
  "contentlength": "6",
  "contribution_desc": "A work-in-progress paper on using the tabletop as a multi-device activity-configuration space (which leads to ActivitySpace). A technical infrastructure for supporting ad hoc multi-device configuration work and resource management for knowledge workers. An interactive desk as a mediating device that enables seamless transitions with device ecologies between nomadic and stationary work contexts.",
  "pid_access": 1528739586,
  "papertype": "Poster",
  "tracking_characteristic": "Tracking devices only; Location 2D; Identity; Outside-in tracking",
  "use_cases": "Knowledge workers",
  "output_modalities": "Screen output",
  "deployment": "field study; contextual inquiry",
  "interaction_techniques": "Data transfer/sharing; Visualisation",
  "connection_classification": "Local master device; Via remote server",
  "toolkits": "academic toolkits; ActivityDesk",
  "device_models": "Microsoft PixelSense",
  "tracking_tech": "Optical",
  "network_infrastructure": "Internet; distributed system",
  "contribution": "Toolkit, middleware; Study, deployment; participatory design workshop",
  "crossdevice_def": "Reconfiguration: \"(i) finding the relevant documents and launching the correct application while moving or distributing work between one device to another device, (ii) dealing with interruptions generated by the different devices in use and, (iii) updating the settings of a device.\"\r\n\r\nConfiguration work: \"The amount of work required to set up an environment so it enables the user to perform a task or activity. It is the effort required to\r\ncontrol, manage and understand information, applications and services that are distributed over all used devices.\""
}