{
  "user_device_rel": "n people to m devices",
  "contentlength": "9",
  "pid": "Klokmose2009",
  "focus": "Software",
  "device_mount": "Handheld; Mounted to wall",
  "pid_done": "2",
  "scale": "Near, personal space; Social space; Room",
  "input_modalities": "Touch; pen",
  "devices_included": "Whiteboard, large vertical display; PDA",
  "use_cases_desc": "- shared game\r\n- shared drawing canvas",
  "evaluation": "Heuristic evaluation (criteria)",
  "contribution_desc": "The paper introduces the notion of ubiquitious instrumental interaction, that supports distributed interaction among multiple devices. \r\n\r\nIt also presents VIGO (Views, Instruments, Governors and\r\nObjects), a software architecture design for the implementation of ubiquitious instrumental interaction.\r\nCompared with MVC, the Model is separated in VIGO into Objects, implementing state, and Governors, implementing\r\nbehavior.\r\n\r\nA prototype implementation of VIGO is described through realizing the pick-and-drop pattern. ",
  "pid_access": 1533807549,
  "papertype": "Full paper",
  "device_models": "SMART Board; Nokia N810 Internet Tablet",
  "output_modalities": "Screen output",
  "deployment": "None",
  "interaction_techniques": "Data transfer/sharing; UI distribution; Cross-device task chaining",
  "connection_classification": "Via remote server",
  "toolkits": "Cocoa; PyGTK; Cairo",
  "use_cases": "Entertainment",
  "tracking_tech": "None",
  "contribution": "Theory; Interaction techniques",
  "crossdevice_def": "\"we now have myriads of small devices, similar in size to [Weiser's] envisioned tabs and pads, and interactive walls are on their way to becoming consumer level products. But the seamless interplay between the multiple device surfaces that Weiser imagined is still far from reality: the simple act of exchanging data among devices typically requires complex configuration or the use of a physical USB key rather than Rekimoto's simple and intuitive pick-and-drop\"\r\n\r\n\"multi-surface interaction, i.e. interaction spanning the surfaces of multiple devices.\"\r\n\r\n\r\n\"The vision of ubiquitous computing includes the idea that multiple users can interact with multiple devices through a variety of interfaces, including interfaces spanning multiple\r\nsurfaces.\""
}