{
  "user_device_rel": "1 person to n devices",
  "target_users": "Expert users",
  "pid": "Koskimies2015",
  "focus": "Software",
  "device_mount": "Handheld",
  "pid_done": "2",
  "scale": "Social space",
  "input_modalities": "Touch",
  "devices_included": "Phone; Tablet; Car; Laptop; Desktop computer; Smart watch",
  "use_cases_desc": "- user is transferring images \"on the fly\" from a smart phone to a tablet\r\n- user is transferring a live application from one tablet to another\r\n- user is transferring application state from her tablet to her car's navigation and entertainment system.",
  "evaluation": "None",
  "contentlength": "4",
  "contribution_desc": "The paper introduce EDB (Elastic DataBase), which was designed to support multiple device ownership and the broader vision of liquid software (movement of applications and data seamlessly between devices for a fluid interaction with multiple devices). ",
  "pid_access": 1530093747,
  "papertype": "Full paper",
  "use_cases": "Entertainment; Knowledge workers; System control",
  "output_modalities": "Screen output",
  "deployment": "None",
  "interaction_techniques": "Data transfer/sharing; UI distribution; Cross-device task chaining",
  "connection_classification": "Via remote server",
  "network_infrastructure": "Internet",
  "contribution": "Toolkit, middleware",
  "crossdevice_def": "\"By liquid software, we refer to an approach in which applications and data can flow from one device or screen to another seamlessly, allowing the users to roam from one device to another without worrying about device management or\r\nhaving to remember complex steps.\"\r\n\"A central aspect of a true, casual multi-device computing experience is the ability to move fluidly from one device to another.\"\r\n\"users can continue doing what they were doing on one device on the other devices, with seamless and fluid transition between the devices, and applications automatically adjusting to the form factor and specific capabilities of each target device.\""
}