{
  "user_device_rel": "1 person to n devices",
  "unsolved": "Configuration work; ",
  "target_users": "Individual",
  "pid": "MarinhoRodrigues2014",
  "focus": "Software",
  "device_mount": "Handheld; Placed loosely around user (e.g., table)",
  "pid_done": "2",
  "scale": "Near, personal space",
  "input_modalities": "Touch",
  "devices_included": "Tablet; Tabletop, large horizontal display",
  "use_cases_desc": "Exploration of geospatial data (population density, etc)",
  "evaluation": "None",
  "contentlength": "5",
  "contribution_desc": "The paper contributes a zoomable user interface with overview (ZUIO), which enables users to use multiple lenses on tablet devices, while a tabletop display shows the overview. Each tablet (in their description 4) can display one or multiple lenses (city view, streets&highways, satellite, electoral districts, population density). The overview highlights the area that's currently displayed on each tablet with a coloured rectangle. ",
  "pid_access": 1534758559,
  "papertype": "Poster",
  "use_cases": "geospatial data exploration",
  "output_modalities": "Screen output",
  "deployment": "None",
  "interaction_techniques": "UI distribution; Data exploration",
  "toolkits": "academic toolkits (Multi-Surface Environment framework SoD)",
  "tracking_tech": "None",
  "network_infrastructure": "WiFi",
  "contribution": "Interaction techniques",
  "crossdevice_def": "\"According to Seyed et al., \"a multi-display environment (MDE) is a system where interaction is divided over several displays, such as digital tabletops, wall displays and personal devices like tablets or mobile phones. MDEs often include heterogeneous displays to take advantage of different capabilities such as their size, position, resolution or mobility to support the task at hand\" [11]. For large information spaces within MDEs, the availability of devices presents an opportunity for exploring how interaction can be divided amongst the different displays. For example, interaction could be spread across different tablets to accomplish a single goal (e.g. finding a location on different types of maps) or interaction could be limited to one tablet and a digital tabletop to accomplish the same goal.\""
}