{
  "user_device_rel": "1 person to n devices; n people to m devices",
  "unsolved": "Perspective correction of display content",
  "target_users": "Individual; Group work",
  "pid": "Nacenta2007",
  "focus": "Software",
  "device_models": "An MDE was set up with 3 displays: a bottom-projected tabletop display (120 x 91cm, 1024 x 768 px), a large verti284 cal display (142 x 106cm, 1024 x 768 px) and a TFT monitor (33 x 27cm, 1280 x 1024 px)",
  "pid_done": "2",
  "scale": "Room",
  "input_modalities": "Mouse; Keyboard",
  "devices_included": "Whiteboard, large vertical display; Laptop; Tabletop, large horizontal display",
  "use_cases_desc": "The tasks used to study E-Conic:\r\n\r\n- Targeting (similar to Fitts' Law)\r\n- Steering (steer a cursor through a tunnel, like a game)\r\n- Copying/Aligning (copy content from one window into another and then aligning it with a proxy)\r\n- Pattern matching\r\n- Reading task",
  "evaluation": "User study (quantitative, controlled lab experiment)",
  "contentlength": "9",
  "contribution_desc": "This paper presents E-Conic, a system that distorts display content in a multi-display environment so that a user can view the content perspectively corrected irrespective of their viewing angle. The \"content\" are application windows (e.g., browser) that can be anchored at a point in virtual space by the user. The distortion is based on the anchor point to avoid \"floating\" windows, which could confuse users.\r\n\r\nE-Conic also works with multiple users where the distortion is based on a measure that distorts windows, so that they are equally \"good\" viewable by users.\r\n\r\nAn evaluation revealed a task performance increase of 8% to 60%.",
  "pid_access": 1537068603,
  "papertype": "Full paper",
  "use_cases": "Knowledge workers",
  "output_modalities": "Screen output",
  "deployment": "Lab study",
  "connection_classification": "Local master device",
  "tracking_characteristic": "Tracking users only; Outside-in tracking",
  "tracking_tech": "Acoustic signals; Static setup",
  "network_infrastructure": "Ethernet (wired)",
  "contribution": "System"
}