{
  "user_device_rel": "n people to m devices",
  "unsolved": "Study only involved dyads",
  "target_users": "Group work",
  "pid": "Plank2017",
  "focus": "Hardware",
  "device_mount": "Placed loosely around user (e.g., table)",
  "pid_done": "2",
  "scale": "Near, personal space",
  "input_modalities": "Touch",
  "devices_included": "Tablet",
  "use_cases_desc": "collaborative visualization",
  "evaluation": "User study (quantitative, controlled lab experiment); User study (qualitative)",
  "contentlength": "10",
  "contribution_desc": "The authors contribute findings from a study about multi tablet usage while collaboratively exploring a visualization task. \r\n\r\nThey found that participants 1) \"underutilized the available tablets and were hesitant to use multiple tablets in parallel, hinting\r\nat a 'legacy bias' of using tablets as 'computers' rather\r\nthan 'documents'\". 2) \"The typical starting configurations\r\nwere 'one tablet per user' and 'one tablet per group' [... and] users only temporarily switched to more complex configurations\" 3)  \"Movements of tablets in space primarily served (i) to improve ergonomics and collaboration and (ii) to establish semantically meaningful orders. However, we did not observe physical piling, filing, or clustering of tablets based on content\". 4) \"Participants transferred familiar techniques and tools from working\r\nwith paper to working with the digital 'documents' on a\r\ntablet, e.g., using hands or paper as guides or rulers.\"\r\n\r\nThe study was conducted in a within-subject setup, where tablets were iether PAIRED (3 groups of 2 tablets each were conntected and the visualisations were linked) or SINGLE (no connection / linking of visualisation).",
  "pid_access": 1525980621,
  "papertype": "Full paper",
  "use_cases": "Sensemaking",
  "output_modalities": "Screen output",
  "deployment": "Lab study",
  "interaction_techniques": "Visualisation; Data exploration",
  "toolkits": "Meteor; D3",
  "tracking_tech": "None",
  "contribution": "Study, deployment",
  "crossdevice_def": "\"A sizable part of HCI research on cross-device interaction is driven by the vision of enabling users to conduct complex knowledge work (e.g., active reading [9, 10], brainstorming [30], sensemaking [16]) by seamlessly working across multiple mobile devices. In this vision, multiple tablets or phones form seamless and powerful device 'communities' [39] or 'symphonies' [16] that can enhance or even replace traditional desktop devices or large screens. This echoes Weiser's vision of ubiquitous computing where mobile 'pad' devices (i.e. tablets) are a commodity similar to sheets of paper and are readily available in our workplaces with up to ten or twenty pads per room [54]. Thereby Weiser's pads are not necessarily owned by individuals but are readily available to be used, passed around, and shared whenever needed.\""
}