{
  "user_device_rel": "1 person to n devices; n people to m devices",
  "target_users": "Individual; Group work",
  "pid": "Rekimoto1997",
  "focus": "Software; Hardware",
  "device_mount": "Handheld; Placed loosely around user (e.g., table)",
  "pid_done": "2",
  "scale": "Social space; Room; Near, personal space",
  "input_modalities": "pen",
  "devices_included": "Laptop; Desktop computer; PDA; Whiteboard, large vertical display",
  "use_cases_desc": "\"- Copying a file from your PDA to your colleague's PDA.\"\r\n\"- When working in front of a wall-sized computer display (such as the LiveBoard or the HoloWall), one may want to pick up a document from one's PDA and attach it to the wall display.\"\r\n\"- When using two or more computers simultaneously (e.g., a notebook PC and a desktop PC), one may want to copy a text string from one computer and paste it on the other computer.\"",
  "evaluation": "None",
  "contentlength": "7.5",
  "contribution_desc": "Pick-and-drop is an interaction technique to transfer data from one display (screen / computer / PDA) to another by \"picking it up\" with a pen from one display and dropping it onto another by touching the second device. Before dropping it, a preview of the data (e.g. file or text snippet) is shown at the drop-location when hovering with the pen over the device. \r\n\r\n\"We also regard this as one of the first manifestations of a multi-computer direct manipulation technique.\"",
  "pid_access": 1535243796,
  "papertype": "Full paper",
  "use_cases": "Knowledge workers; drawing",
  "output_modalities": "Screen output",
  "deployment": "None",
  "interaction_techniques": "Data transfer/sharing",
  "connection_classification": "P2P",
  "toolkits": "Java",
  "device_models": "MITSUBISHI AMITYs as palmtop pen computers; WACOM PL300 liquid crystal display as a VGA compatible pen-sensitive desktop screen; WACOM MeetingStaff and thr projector as a wall-sized display",
  "tracking_tech": "None",
  "network_infrastructure": "WiFi; LAN",
  "contribution": "Interaction techniques",
  "crossdevice_def": "\"In 8. ubiquitous computing (UbiComp) environment, we no longer use a single computer to perform tasks. Instead, many of our daily activities including discussion, documentation, and meetings will be supported by the combination of many (and often different kinds of) computers. Combinations of computers will be quite dynamic and heterogeneous\"; multiple-computer user interfaces"
}