{
  "user_device_rel": "n people to m devices",
  "target_users": "Individual; Group work; Expert users",
  "pid": "Waldner2010b",
  "device_mount": "Placed loosely around user (e.g., table); Mounted to wall; Projectors",
  "pid_done": "2",
  "scale": "Room",
  "input_modalities": "Mouse",
  "devices_included": "Any screen device; Projectors; Laptop; Desktop computer",
  "use_cases_desc": "Tasks and applications remain abstract. \r\nFocus is the study of mouse cursor operations with 4 techniques: Mouse path navigation (compared to stitching); Perspective Mouse Cursor; World in Miniature view (WiM); Mouse Pointer warping",
  "evaluation": "User study (quantitative, controlled lab experiment); Comparing 4 mouse cursor operations.",
  "contentlength": "4",
  "contribution_desc": "Paper addressing difficulties of mouse cursor movement in a multi-monitor environment or multi-display environment. Mostly concerned with different laptops, desktops and projectors, and the difficulties of moving mouse cursors across displays.\r\nRunning study comparing four mouse cursor navigation techniques, and discuss limitations of multi-display mouse movement operations.",
  "pid_access": 1533216180,
  "papertype": "Workshop",
  "output_modalities": "Screen output",
  "deployment": "Lab study",
  "interaction_techniques": "Mouse path navigation (compared to stitching); Perspective Mouse Cursor; World in Miniature view (WiM); Mouse Pointer warping",
  "connection_classification": "Local master device",
  "tracking_tech": "None; mostly fixed mounted displays or projectors",
  "network_infrastructure": "Wired mostly, connections between screens to master device; Ethernet",
  "contribution": "Study (human factors); Interaction techniques",
  "crossdevice_def": "Multi-display environments (MDEs). \r\n\r\n\"The availability of affordable display technology has given rise to a wide variety of multi-display environments (MDE). Especially in conventional office and team spaces, users can extend private workspaces with shared interaction spaces by projecting imagery onto unused wall and table spaces\""
}