{
  "user_device_rel": "n people to m devices",
  "target_users": "Expert users",
  "pid": "Wilson2014",
  "focus": "Software",
  "device_mount": "Handheld; Mounted to wall; Placed loosely around user (e.g., table)",
  "pid_done": "2",
  "input_modalities": "Touch; Keyboard; Mouse",
  "devices_included": "Tablet; Tabletop, large horizontal display; Laptop",
  "use_cases_desc": "- Analysis of Competing Hypotheses (ACH)\r\n\r\n- \"While 'ACH Walkthrough' can be used for ACH analysis generally, we especially intend for it to be used for a collaborative review, where a small team members of analysis work together. In particular, we suggest an approach similar to that suggested by Wharton et al. called the \"Cognitive Walkthrough\", where a team walks through steps, discussing and executing each step together, each team member contributing from their perspective.\"",
  "evaluation": "None",
  "contentlength": "7.5",
  "contribution_desc": "\"This paper presents AchWalkthrough (ACH-W), a prototype software application to demonstrate the potential benefits of surface technologies in collaborative intelligence analysis.\"\r\n\r\nThe system has very limited cross-device interaction capabilities. From the paper it is not clear how far any interactions actually span across multiple devices rathern than just data being updated.\r\nThe design choices are mainly grounded on the authors views and oppinions, rather than any studies / evidence.",
  "pid_access": 1526941366,
  "papertype": "Full paper",
  "device_models": "PQ Labs touch overlay; macbook; windows laptop",
  "output_modalities": "Screen output",
  "deployment": "None",
  "interaction_techniques": "Data exploration; Cross-device task chaining",
  "connection_classification": "Via remote server",
  "toolkits": "Javascript; HTML5; Meteor",
  "use_cases": "Knowledge workers",
  "network_infrastructure": "Internet; WiFi",
  "contribution": "System",
  "crossdevice_def": "\"In the walkthrough, our multiple device architecture also supports multiple perspectives on the data. [...] several devices can be used simultaneously with different views, and any changes made to the data are instantly synchronized. It would be possible, for example, to have two large touch displays, so that one could be used to consider consistency ratings, and the other could be used to browse the evidence documents. At the same time, individual analysts could check other tabs on the analysis using tablets or smartphones\"."
}