{
  "user_device_rel": "1 person to n devices",
  "unsolved": "usage of multiple devices in concert. ",
  "target_users": "Individual",
  "pid": "Zagermann2017",
  "focus": "Software",
  "device_mount": "Placed loosely around user (e.g., table)",
  "pid_done": "2",
  "scale": "Near, personal space",
  "input_modalities": "Touch",
  "devices_included": "Phone; Tabletop, large horizontal display",
  "use_cases_desc": "\"In the study, participants had to perform three individual creative tasks (one for each condition). The task was based on the game Story Cubes. Originally, the game consists of cubes with simplified representations of objects, animals, emotions etc. on each face (see Figure 2). Players have to roll multiple dice at once and use the combination of images to tell a coherent story. Players are free to arrange the dice to support their story. The simplified and icon-like nature of the representations are perceived individually, which allows for varieties of associations and eases getting started.\"\r\n\"We adapted the original game play as follows: For each task, we used a randomized subset of 6 out of 82 images (see Figure 2), that were not shown before, neither during an initial test phase nor during one of the other conditions. Participants were asked to work with the images and create a short reasonable story based on them. In contrast to the original game play, participants were encouraged to not only move and arrange images, but also add additional content (e.g. draw objects, change content, resize or multiply images) using the available tools.\"",
  "evaluation": "User study (qualitative); User study (quantitative, controlled lab experiment)",
  "contentlength": "9",
  "contribution_desc": "The authors build a (multi-device) system / distributed cross-device system that allowed a single user to arange images and paint on a canvas. They studied three conditions: 1) tools are selected via a selection menu, 2) tools are selected and adapted via panels, which can be re-arranged outside the core-working area, and 3) the panels are placed on mobile phones, which users can arrange around the table as they want. \r\nThey draw on the notion of instrumental interaction. \r\n\r\nParticipants enjoyed the flexibility, but  were \"hesitated to exploit the potentials of physical devices (phones) but arranged their workspaces before starting the actual task\". They \"had difficulties with the awareness of the properties of the tools and with using multiple tools in combination in panels and phones [... and] had troubles with an inconsistent behavior of using a tool on different objects.\"",
  "pid_access": 1534186160,
  "papertype": "Full paper",
  "use_cases": "Creative",
  "output_modalities": "Screen output",
  "deployment": "Lab study",
  "interaction_techniques": "UI distribution",
  "fabrication": "Cardboard cover of the tabletop in the ",
  "toolkits": "academic toolkits; Webstrates",
  "device_models": "Microsoft Perceptive Pixel; ASUS PadFone Infinity",
  "tracking_tech": "None",
  "contribution": "Interaction techniques; Study, deployment",
  "crossdevice_def": "\"On the practical side, research into cross-device interaction has been done to raise mutual awareness of devices, either via additional hardware augmentation or based on software using built-in resources. On the theoretical side, working styles known from traditional work practices using pens and rulers have been taken as a basis to establish models that conceptually guide the combination of multiple interactive artifacts into one coherent work environment\""
}